tutorials/lagrangian/reactingParcelFoam/filter/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 100000;
    }
    cycLeft_half0
    {
        type            cyclic;
    }
    cycRight_half0
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
    cycLeft_half1
    {
        type            cyclic;
    }
    cycRight_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
